Revit 2027 API
Sweep.ProfileSketch Property
The profile sketch of the sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch ProfileSketch { get; }
Public ReadOnly Property ProfileSketch As Sketch
	Get
public:
property Sketch^ ProfileSketch {
	Sketch^ get ();
}
member ProfileSketch : Sketch with get
Property Value
Sketch
Remarks
If the profile is not based on sketched curves, this property is null.
See Also
Reference
Sweep Class
Autodesk.Revit.DB Namespace